Revit 2027 API
FilteredWorksetIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Workset Current { get; }
Public Overridable ReadOnly Property Current As Workset
	Get
public:
virtual property Workset^ Current {
	Workset^ get ();
}
abstract Current : Workset with get
override Current : Workset with get
Property Value
Workset
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
FilteredWorksetIterator Class
Autodesk.Revit.DB Namespace